Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: اصبر على ما يقولون واذكر عبدنا داوود ذا الأيد إنه أواب
en: Have patience at what they say, and remember our servant David, the man of strength: for he ever turned (to Allah).

source: إنا سخرنا الجبال معه يسبحن بالعشي والإشراق
en: It was We that made the hills declare, in unison with him, Our Praises, at eventide and at break of day,

source: والطير محشورة كل له أواب
en: And the birds gathered (in assemblies): all with him did turn (to Allah).

source: وشددنا ملكه وآتيناه الحكمة وفصل الخطاب
en: We strengthened his kingdom, and gave him wisdom and sound judgment in speech and decision.

source: وهل أتاك نبأ الخصم إذ تسوروا المحراب
en: Has the Story of the Disputants reached thee? Behold, they climbed over the wall of the private chamber;

source: إذ دخلوا على داوود ففزع منهم قالوا لا تخف خصمان بغى بعضنا على بعض فاحكم بيننا بالحق ولا تشطط واهدنا إلى سواء الصراط
en: When they entered the presence of David, and he was terrified of them, they said: "Fear not: we are two disputants, one of whom has wronged the other: Decide now between us with truth, and treat us not with injustice, but guide us to the even Path..

source: إن هذا أخي له تسع وتسعون نعجة ولي نعجة واحدة فقال أكفلنيها وعزني في الخطاب
en: "This man is my brother: He has nine and ninety ewes, and I have (but) one: Yet he says, 'commit her to my care,' and is (moreover) harsh to me in speech."

source: قال لقد ظلمك بسؤال نعجتك إلى نعاجه وإن كثيرا من الخلطاء ليبغي بعضهم على بعض إلا الذين آمنوا وعملوا الصالحات وقليل ما هم وظن داوود أنما فتناه فاستغفر ربه وخر راكعا وأناب
en: (David) said: "He has undoubtedly wronged thee in demanding thy (single) ewe to be added to his (flock of) ewes: truly many are the partners (in business) who wrong each other: Not so do those who believe and work deeds of righteousness, and how few are they?"... and David gathered that We had tried him: he asked forgiveness of his Lord, fell down, bowing (in prostration), and turned (to Allah in repentance).

source: فغفرنا له ذلك وإن له عندنا لزلفى وحسن مآب
en: So We forgave him this (lapse): he enjoyed, indeed, a Near Approach to Us, and a beautiful place of (Final) Return.

source: يا داوود إنا جعلناك خليفة في الأرض فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله إن الذين يضلون عن سبيل الله لهم عذاب شديد بما نسوا يوم الحساب
en: O David! We did indeed make thee a vicegerent on earth: so judge thou between men in truth (and justice): Nor follow thou the lusts (of thy heart), for they will mislead thee from the Path of Allah: for those who wander astray from the Path of Allah, is a Penalty Grievous, for that they forget the Day of Account.

source: وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار
en: Not without purpose did We create heaven and earth and all between! that were the thought of Unbelievers! but woe to the Unbelievers because of the Fire (of Hell)!

source: أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار
en: Shall We treat those who believe and work deeds of righteousness, the same as those who do mischief on earth? Shall We treat those who guard against evil, the same as those who turn aside from the right?

source: كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولو الألباب
en: (Here is) a Book which We have sent down unto thee, full of blessings, that they may mediate on its Signs, and that men of understanding may receive admonition.

source: ووهبنا لداوود سليمان نعم العبد إنه أواب
en: To David We gave Solomon (for a son),- How excellent in Our service! Ever did he turn (to Us)!

source: إذ عرض عليه بالعشي الصافنات الجياد
en: Behold, there were brought before him, at eventide coursers of the highest breeding, and swift of foot;

source: فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب
en: And he said, "Truly do I love the love of good, with a view to the glory of my Lord,"- until (the sun) was hidden in the veil (of night):

source: ردوها علي فطفق مسحا بالسوق والأعناق
en: "Bring them back to me." then began he to pass his hand over (their) legs and their necks.

source: ولقد فتنا سليمان وألقينا على كرسيه جسدا ثم أناب
en: And We did try Solomon: We placed on his throne a body (without life); but he did turn (to Us in true devotion):

source: قال رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب
en: He said, "O my Lord! Forgive me, and grant me a kingdom which, (it may be), suits not another after me: for Thou art the Grantor of Bounties (without measure).

source: فسخرنا له الريح تجري بأمره رخاء حيث أصاب
en: Then We subjected the wind to his power, to flow gently to his order, Whithersoever he willed,-

source: والشياطين كل بناء وغواص
en: As also the evil ones, (including) every kind of builder and diver,-

source: وآخرين مقرنين في الأصفاد
en: As also others bound together in fetters.

source: هذا عطاؤنا فامنن أو أمسك بغير حساب
en: "Such are Our Bounties: whether thou bestow them (on others) or withhold them, no account will be asked."

source: وإن له عندنا لزلفى وحسن مآب
en: And he enjoyed, indeed, a Near Approach to Us, and a beautiful Place of (Final) Return.

source: واذكر عبدنا أيوب إذ نادى ربه أني مسني الشيطان بنصب وعذاب
en: Commemorate Our Servant Job. Behold he cried to his Lord: "The Evil One has afflicted me with distress and suffering!"

source: اركض برجلك هذا مغتسل بارد وشراب
en: (The command was given:) "Strike with thy foot: here is (water) wherein to wash, cool and refreshing, and (water) to drink."

source: ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب
en: And We gave him (back) his people, and doubled their number,- as a Grace from Ourselves, and a thing for commemoration, for all who have Understanding.

source: وخذ بيدك ضغثا فاضرب به ولا تحنث إنا وجدناه صابرا نعم العبد إنه أواب
en: "And take in thy hand a little grass, and strike therewith: and break not (thy oath)." Truly We found him full of patience and constancy. How excellent in Our service! ever did he turn (to Us)!

source: واذكر عبادنا إبراهيم وإسحاق ويعقوب أولي الأيدي والأبصار
en: And commemorate Our Servants Abraham, Isaac, and Jacob, possessors of Power and Vision.

source: إنا أخلصناهم بخالصة ذكرى الدار
en: Verily We did choose them for a special (purpose)- proclaiming the Message of the Hereafter.

source: وإنهم عندنا لمن المصطفين الأخيار
en: They were, in Our sight, truly, of the company of the Elect and the Good.

source: واذكر إسماعيل واليسع وذا الكفل وكل من الأخيار
en: And commemorate Isma'il, Elisha, and Zul-Kifl: Each of them was of the Company of the Good.

source: هذا ذكر وإن للمتقين لحسن مآب
en: This is a Message (of admonition): and verily, for the righteous, is a beautiful Place of (Final) Return,-

source: جنات عدن مفتحة لهم الأبواب
en: Gardens of Eternity, whose doors will (ever) be open to them;

source: متكئين فيها يدعون فيها بفاكهة كثيرة وشراب
en: Therein will they recline (at ease): Therein can they call (at pleasure) for fruit in abundance, and (delicious) drink;

source: وعندهم قاصرات الطرف أتراب
en: And beside them will be chaste women restraining their glances, (companions) of equal age.

source: هذا ما توعدون ليوم الحساب
en: Such is the Promise made, to you for the Day of Account!

source: إن هذا لرزقنا ما له من نفاد
en: Truly such will be Our Bounty (to you); it will never fail;-

source: هذا وإن للطاغين لشر مآب
en: Yea, such! but - for the wrong-doers will be an evil place of (Final) Return!-

source: جهنم يصلونها فبئس المهاد
en: Hell!- they will burn therein, - an evil bed (indeed, to lie on)!-

source: هذا فليذوقوه حميم وغساق
en: Yea, such! - then shall they taste it,- a boiling fluid, and a fluid dark, murky, intensely cold!-

source: وآخر من شكله أزواج
en: And other Penalties of a similar kind, to match them!

source: هذا فوج مقتحم معكم لا مرحبا بهم إنهم صالو النار
en: Here is a troop rushing headlong with you! No welcome for them! truly, they shall burn in the Fire!

source: قالوا بل أنتم لا مرحبا بكم أنتم قدمتموه لنا فبئس القرار
en: (The followers shall cry to the misleaders:) "Nay, ye (too)! No welcome for you! It is ye who have brought this upon us! Now evil is (this) place to stay in!"

source: قالوا ربنا من قدم لنا هذا فزده عذابا ضعفا في النار
en: They will say: "Our Lord! whoever brought this upon us,- Add to him a double Penalty in the Fire!"

source: وقالوا ما لنا لا نرى رجالا كنا نعدهم من الأشرار
en: And they will say: "What has happened to us that we see not men whom we used to number among the bad ones?

source: أتخذناهم سخريا أم زاغت عنهم الأبصار
en: "Did we treat them (as such) in ridicule, or have (our) eyes failed to perceive them?"

source: إن ذلك لحق تخاصم أهل النار
en: Truly that is just and fitting,- the mutual recriminations of the People of the Fire!

source: قل إنما أنا منذر وما من إله إلا الله الواحد القهار
en: Say: "Truly am I a Warner: no god is there but the one Allah, Supreme and Irresistible,-

source: رب السماوات والأرض وما بينهما العزيز الغفار
en: "The Lord of the heavens and the earth, and all between,- Exalted in Might, able to enforce His Will, forgiving again and again."

source: قل هو نبأ عظيم
en: Say: "That is a Message Supreme (above all),-

source: أنتم عنه معرضون
en: "From which ye do turn away!

source: ما كان لي من علم بالملإ الأعلى إذ يختصمون
en: "No knowledge have I of the Chiefs on high, when they discuss (matters) among themselves.

source: إن يوحى إلي إلا أنما أنا نذير مبين
en: 'Only this has been revealed to me: that I am to give warning plainly and publicly."

source: إذ قال ربك للملائكة إني خالق بشرا من طين
en: Behold, thy Lord said to the angels: "I am about to create man from clay:

source: إلا إبليس استكبر وكان من الكافرين
en: Not so Iblis: he was haughty, and became one of those who reject Faith.

source: قال يا إبليس ما منعك أن تسجد لما خلقت بيدي أستكبرت أم كنت من العالين
en: (Allah) said: "O Iblis! What prevents thee from prostrating thyself to one whom I have created with my hands? Art thou haughty? Or art thou one of the high (and mighty) ones?"

source: قال أنا خير منه خلقتني من نار وخلقته من طين
en: (Iblis) said: "I am better than he: thou createdst me from fire, and him thou createdst from clay."

source: وإن عليك لعنتي إلى يوم الدين
en: "And My curse shall be on thee till the Day of Judgment."

source: قال فبعزتك لأغوينهم أجمعين
en: (Iblis) said: "Then, by Thy power, I will put them all in the wrong,-

source: قال فالحق والحق أقول
en: (Allah) said: "Then it is just and fitting- and I say what is just and fitting-

source: لأملأن جهنم منك وممن تبعك منهم أجمعين
en: "That I will certainly fill Hell with thee and those that follow thee,- every one."

source: قل ما أسألكم عليه من أجر وما أنا من المتكلفين
en: Say: "No reward do I ask of you for this (Qur'an), nor am I a pretender.

source: إن هو إلا ذكر للعالمين
en: "This is no less than a Message to (all) the Worlds.

source: ولتعلمن نبأه بعد حين
en: "And ye shall certainly know the truth of it (all) after a while."

source: تنزيل الكتاب من الله العزيز الحكيم
en: The revelation of this Book is from Allah, the Exalted in Power, full of Wisdom.

source: إنا أنزلنا إليك الكتاب بالحق فاعبد الله مخلصا له الدين
en: Verily it is We Who have revealed the Book to thee in Truth: so serve Allah, offering Him sincere devotion.

source: ألا لله الدين الخالص والذين اتخذوا من دونه أولياء ما نعبدهم إلا ليقربونا إلى الله زلفى إن الله يحكم بينهم في ما هم فيه يختلفون إن الله لا يهدي من هو كاذب كفار
en: Is it not to Allah that sincere devotion is due? But those who take for protectors other than Allah (say): "We only serve them in order that they may bring us nearer to Allah." Truly Allah will judge between them in that wherein they differ. But Allah guides not such as are false and ungrateful.

source: لو أراد الله أن يتخذ ولدا لاصطفى مما يخلق ما يشاء سبحانه هو الله الواحد القهار
en: Had Allah wished to take to Himself a son, He could have chosen whom He pleased out of those whom He doth create: but Glory be to Him! (He is above such things.) He is Allah, the One, the Irresistible.

source: خلق السماوات والأرض بالحق يكور الليل على النهار ويكور النهار على الليل وسخر الشمس والقمر كل يجري لأجل مسمى ألا هو العزيز الغفار
en: He created the heavens and the earth in true (proportions): He makes the Night overlap the Day, and the Day overlap the Night: He has subjected the sun and the moon (to His law): Each one follows a course for a time appointed. Is not He the Exalted in Power - He Who forgives again and again?

source: خلقكم من نفس واحدة ثم جعل منها زوجها وأنزل لكم من الأنعام ثمانية أزواج يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث ذلكم الله ربكم له الملك لا إله إلا هو فأنى تصرفون
en: He created you (all) from a single person: then created, of like nature, his mate; and he sent down for you eight head of cattle in pairs: He makes you, in the wombs of your mothers, in stages, one after another, in three veils of darkness. such is Allah, your Lord and Cherisher: to Him belongs (all) dominion. There is no god but He: then how are ye turned away (from your true Centre)?

source: إن تكفروا فإن الله غني عنكم ولا يرضى لعباده الكفر وإن تشكروا يرضه لكم ولا تزر وازرة وزر أخرى ثم إلى ربكم مرجعكم فينبئكم بما كنتم تعملون إنه عليم بذات الصدور
en: If ye reject (Allah), Truly Allah hath no need of you; but He liketh not ingratitude from His servants: if ye are grateful, He is pleased with you. No bearer of burdens can bear the burden of another. In the end, to your Lord is your Return, when He will tell you the truth of all that ye did (in this life). for He knoweth well all that is in (men's) hearts.

source: وإذا مس الإنسان ضر دعا ربه منيبا إليه ثم إذا خوله نعمة منه نسي ما كان يدعو إليه من قبل وجعل لله أندادا ليضل عن سبيله قل تمتع بكفرك قليلا إنك من أصحاب النار
en: When some trouble toucheth man, he crieth unto his Lord, turning to Him in repentance: but when He bestoweth a favour upon him as from Himself, (man) doth forget what he cried and prayed for before, and he doth set up rivals unto Allah, thus misleading others from Allah's Path. Say, "Enjoy thy blasphemy for a little while: verily thou art (one) of the Companions of the Fire!"

source: أمن هو قانت آناء الليل ساجدا وقائما يحذر الآخرة ويرجو رحمة ربه قل هل يستوي الذين يعلمون والذين لا يعلمون إنما يتذكر أولو الألباب
en: Is one who worships devoutly during the hour of the night prostrating himself or standing (in adoration), who takes heed of the Hereafter, and who places his hope in the Mercy of his Lord - (like one who does not)? Say: "Are those equal, those who know and those who do not know? It is those who are endued with understanding that receive admonition.

source: قل يا عباد الذين آمنوا اتقوا ربكم للذين أحسنوا في هذه الدنيا حسنة وأرض الله واسعة إنما يوفى الصابرون أجرهم بغير حساب
en: Say: "O ye my servants who believe! Fear your Lord, good is (the reward) for those who do good in this world. Spacious is Allah's earth! those who patiently persevere will truly receive a reward without measure!"

source: قل إني أمرت أن أعبد الله مخلصا له الدين
en: Say: "Verily, I am commanded to serve Allah with sincere devotion;

source: وأمرت لأن أكون أول المسلمين
en: "And I am commanded to be the first of those who bow to Allah in Islam."

source: قل الله أعبد مخلصا له ديني
en: Say: "It is Allah I serve, with my sincere (and exclusive) devotion:

source: فاعبدوا ما شئتم من دونه قل إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا ذلك هو الخسران المبين
en: "Serve ye what ye will besides him." Say: "Truly, those in loss are those who lose their own souls and their People on the Day of Judgment: Ah! that is indeed the (real and) evident Loss!

source: لهم من فوقهم ظلل من النار ومن تحتهم ظلل ذلك يخوف الله به عباده يا عباد فاتقون
en: They shall have Layers of Fire above them, and Layers (of Fire) below them: with this doth Allah warn off his servants: "O My Servants! then fear ye Me!"

source: والذين اجتنبوا الطاغوت أن يعبدوها وأنابوا إلى الله لهم البشرى فبشر عباد
en: Those who eschew Evil,- and fall not into its worship,- and turn to Allah (in repentance),- for them is Good News: so announce the Good News to My Servants,-

source: الذين يستمعون القول فيتبعون أحسنه أولئك الذين هداهم الله وأولئك هم أولو الألباب
en: Those who listen to the Word, and follow the best (meaning) in it: those are the ones whom Allah has guided, and those are the ones endued with understanding.

source: أفمن حق عليه كلمة العذاب أفأنت تنقذ من في النار
en: Is, then, one against whom the decree of Punishment is justly due (equal to one who eschews Evil)? Wouldst thou, then, deliver one (who is) in the Fire?

source: لكن الذين اتقوا ربهم لهم غرف من فوقها غرف مبنية تجري من تحتها الأنهار وعد الله لا يخلف الله الميعاد
en: But it is for those who fear their Lord. That lofty mansions, one above another, have been built: beneath them flow rivers (of delight): (such is) the Promise of Allah: never doth Allah fail in (His) promise.

source: ألم تر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض ثم يخرج به زرعا مختلفا ألوانه ثم يهيج فتراه مصفرا ثم يجعله حطاما إن في ذلك لذكرى لأولي الألباب
en: Seest thou not that Allah sends down rain from the sky, and leads it through springs in the earth? Then He causes to grow, therewith, produce of various colours: then it withers; thou wilt see it grow yellow; then He makes it dry up and crumble away. Truly, in this, is a Message of remembrance to men of understanding.

source: أفمن شرح الله صدره للإسلام فهو على نور من ربه فويل للقاسية قلوبهم من ذكر الله أولئك في ضلال مبين
en: Is one whose heart Allah has opened to Islam, so that he has received Enlightenment from Allah, (no better than one hard-hearted)? Woe to those whose hearts are hardened against celebrating the praises of Allah! they are manifestly wandering (in error)!

source: الله نزل أحسن الحديث كتابا متشابها مثاني تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله ذلك هدى الله يهدي به من يشاء ومن يضلل الله فما له من هاد
en: Allah has revealed (from time to time) the most beautiful Message in the form of a Book, consistent with itself, (yet) repeating (its teaching in various aspects): the skins of those who fear their Lord tremble thereat; then their skins and their hearts do soften to the celebration of Allah's praises. Such is the guidance of Allah: He guides therewith whom He pleases, but such as Allah leaves to stray, can have none to guide.

source: أفمن يتقي بوجهه سوء العذاب يوم القيامة وقيل للظالمين ذوقوا ما كنتم تكسبون
en: Is, then, one who has to fear the brunt of the Penalty on the Day of Judgment (and receive it) on his face, (like one guarded therefrom)? It will be said to the wrong-doers: "Taste ye (the fruits of) what ye earned!"

source: كذب الذين من قبلهم فأتاهم العذاب من حيث لا يشعرون
en: Those before them (also) rejected (revelation), and so the Punishment came to them from directions they did not perceive.

source: فأذاقهم الله الخزي في الحياة الدنيا ولعذاب الآخرة أكبر لو كانوا يعلمون
en: So Allah gave them a taste of humiliation in the present life, but greater is the punishment of the Hereafter, if they only knew!

source: ولقد ضربنا للناس في هذا القرآن من كل مثل لعلهم يتذكرون
en: We have put forth for men, in this Qur'an every kind of Parable, in order that they may receive admonition.

source: قرآنا عربيا غير ذي عوج لعلهم يتقون
en: (It is) a Qur'an in Arabic, without any crookedness (therein): in order that they may guard against Evil.

source: ضرب الله مثلا رجلا فيه شركاء متشاكسون ورجلا سلما لرجل هل يستويان مثلا الحمد لله بل أكثرهم لا يعلمون
en: Allah puts forth a Parable a man belonging to many partners at variance with each other, and a man belonging entirely to one master: are those two equal in comparison? Praise be to Allah! but most of them have no knowledge.

source: إنك ميت وإنهم ميتون
en: Truly thou wilt die (one day), and truly they (too) will die (one day).

source: ثم إنكم يوم القيامة عند ربكم تختصمون
en: In the end will ye (all), on the Day of Judgment, settle your disputes in the presence of your Lord.

source: فمن أظلم ممن كذب على الله وكذب بالصدق إذ جاءه أليس في جهنم مثوى للكافرين
en: Who, then, doth more wrong than one who utters a lie concerning Allah, and rejects the Truth when it comes to him; is there not in Hell an abode for blasphemers?

source: والذي جاء بالصدق وصدق به أولئك هم المتقون
en: And he who brings the Truth and he who confirms (and supports) it - such are the men who do right.

source: لهم ما يشاءون عند ربهم ذلك جزاء المحسنين
en: They shall have all that they wish for, in the presence of their Lord: such is the reward of those who do good:

source: ليكفر الله عنهم أسوأ الذي عملوا ويجزيهم أجرهم بأحسن الذي كانوا يعملون
en: So that Allah will turn off from them (even) the worst in their deeds and give them their reward according to the best of what they have done.

source: أليس الله بكاف عبده ويخوفونك بالذين من دونه ومن يضلل الله فما له من هاد
en: Is not Allah enough for his Servant? But they try to frighten thee with other (gods) besides Him! for such as Allah leaves to stray, there can be no guide.

source: ومن يهد الله فما له من مضل أليس الله بعزيز ذي انتقام
en: And such as Allah doth guide there can be none to lead astray. Is not Allah Exalted in Power, (Able to enforce His Will), Lord of Retribution?

source: ولئن سألتهم من خلق السماوات والأرض ليقولن الله قل أفرأيتم ما تدعون من دون الله إن أرادني الله بضر هل هن كاشفات ضره أو أرادني برحمة هل هن ممسكات رحمته قل حسبي الله عليه يتوكل المتوكلون
en: If indeed thou ask them who it is that created the heavens and the earth, they would be sure to say, "Allah". Say: "See ye then? the things that ye invoke besides Allah,- can they, if Allah wills some Penalty for me, remove His Penalty?- Or if He wills some Grace for me, can they keep back his Grace?" Say: "Sufficient is Allah for me! In Him trust those who put their trust."

source: قل يا قوم اعملوا على مكانتكم إني عامل فسوف تعلمون
en: Say: "O my People! Do whatever ye can: I will do (my part): but soon will ye know-

source: من يأتيه عذاب يخزيه ويحل عليه عذاب مقيم
en: "Who it is to whom comes a Penalty of ignominy, and on whom descends a Penalty that abides."

source: إنا أنزلنا عليك الكتاب للناس بالحق فمن اهتدى فلنفسه ومن ضل فإنما يضل عليها وما أنت عليهم بوكيل
en: Verily We have revealed the Book to thee in Truth, for (instructing) mankind. He, then, that receives guidance benefits his own soul: but he that strays injures his own soul. Nor art thou set over them to dispose of their affairs.

source: الله يتوفى الأنفس حين موتها والتي لم تمت في منامها فيمسك التي قضى عليها الموت ويرسل الأخرى إلى أجل مسمى إن في ذلك لآيات لقوم يتفكرون
en: It is Allah that takes the souls (of men) at death; and those that die not (He takes) during their sleep: those on whom He has passed the decree of death, He keeps back (from returning to life), but the rest He sends (to their bodies) for a term appointed verily in this are Signs for those who reflect.

source: أم اتخذوا من دون الله شفعاء قل أولو كانوا لا يملكون شيئا ولا يعقلون
en: What! Do they take for intercessors others besides Allah? Say: "Even if they have no power whatever and no intelligence?"

source: قل لله الشفاعة جميعا له ملك السماوات والأرض ثم إليه ترجعون
en: Say: "To Allah belongs exclusively (the right to grant) intercession: to Him belongs the dominion of the heavens and the earth: In the End, it is to Him that ye shall be brought back."

source: وإذا ذكر الله وحده اشمأزت قلوب الذين لا يؤمنون بالآخرة وإذا ذكر الذين من دونه إذا هم يستبشرون
en: When Allah, the One and Only, is mentioned, the hearts of those who believe not in the Hereafter are filled with disgust and horror; but when (gods) other than He are mentioned, behold, they are filled with joy!

source: قل اللهم فاطر السماوات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك في ما كانوا فيه يختلفون
en: Say: "O Allah! Creator of the heavens and the earth! Knower of all that is hidden and open! it is Thou that wilt judge between Thy Servants in those matters about which they have differed."
